Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_welfare_system_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Social welfare system in Ireland
ga: An córas leasa shóisialaigh in Éirinn

source: The social welfare system in Ireland is divided into three main types of payments
ga: Tá trí phríomhchineál íocaíochtaí sa chóras leasa shóisialaigh in Éirinn

source: With all social welfare payments, you must satisfy specific personal circumstances that are set out in the rules for each scheme
ga: Tá cúinsí ar leith pearsanta nach mór duit a chomhlíonadh le haon íocaíocht leasa shóisialaigh a fháil agus tá na cúinsí sin leagtha síos sna rialacha a bhaineann le gach scéim

source: For example, to claim the One-Parent Family Payment, you must be parenting alone and therefore not cohabiting
ga: Mar shampla, le héileamh a dhéanamh ar Íocaíocht Teaghlaigh Aontuismitheora, ní mór duit a bheith i do thuismitheoir aonair agus gan a bheith i do chónaí le duine eile mar fhear agus bean

source: As well as satisfying the necessary circumstantial criteria, other rules also apply. We briefly explain these under the headings for the different types of payments
ga: Chomh maith leis na critéir faoi leith chuí a shásamh, baineann rialacha eile le híocaíochtaí agus tá cur síos gairid orthu faoi na ceannteidil a bhaineann leis na cineálacha éagsúla íocaíochtaí

source: There is also a range of employment schemes and other supports which encourage long-term unemployed people to return to work
ga: Tá raon scéimeanna fostaíochta ann mar aon le tacaíochtaí eile a spreagann daoine atá dífhostaithe go fadtéarmach chun filleadh ar obair

source: Since May 2004, you must be habitually resident to qualify for social assistance payments in Ireland
ga: Ó mhí Bealtaine 2004, caithfidh gnáthchónaí a bheith ort sa tír le bheith incháilithe d’íocaíochtaí cúnaimh shóisialaigh in Éirinn

source: Find out more about the residency requirements for social assistance payments in Ireland
ga: Tuilleadh eolais anseo faoi riachtanais cónaitheachta maidir le híocaíochtaí cúnaimh shóisialaigh in Éirinn

source: Social insurance payments are given to people who satisfy specific social insurance contribution conditions (PRSI conditions), in addition to the necessary circumstantial conditions
ga: Tugtar íocaíochtaí árachais shóisialta do dhaoine a shásaíonn coinníollacha ranníocaíochta an árachais shóisialta (coinníollacha ÁSPC), chomh maith leis na coinníollacha imthoisceacha atá riachtanach

source: These conditions vary, depending on the payment you apply for
ga: Athraíonn na coinníollacha sin ag brath ar an íocaíocht ar a bhfuil iarratas á dhéanamh

source: A summary of the PRSI contribution conditions for each payment is set out in individual leaflets on different payments, which are available on the Department of Social Protection's website
ga: Tá achoimre ar choinníollacha ranníocaíochta ÁSPC maidir le gach íocaíocht leagtha amach i mbileoga aonair ar íocaíochtaí difriúla, atá ar fáil ari láithreán gréasáin na Roinne Coimirce Sóisialaí

source: Payments based on your social insurance contributions include Jobseeker's Benefit, Illness Benefit, Maternity Benefit, Invalidity Pension, Carer's Benefit and State Pension (Contributory)
ga: Seo a leanas samplaí d’íocaíochtaí atá bunaithe ar ranníocaíochtaí árachais shóisialta: Sochar Cuardaitheora Poist, Sochar Breoiteachta, Sochar Máithreachais, Pinsean Easláinte, Sochar Cúramóra agus Pinsean Stáit (Ranníocach)

source: Means-tested payments are designed for people who do not have enough PRSI contributions to qualify for the equivalent social insurance-based payments
ga: Is éard atá sna híocaíochtaí de réir tástála acmhainne ná íocaíochtaí a leagadh amach le haghaidh daoine nach bhfuil go leor ranníocaíochtaí ÁSPC acu le bheith incháilithe le haghaidh a gcoibhéis d’íocaíochtaí bunaithe ar árachas sóisialta

source: An example would be a person who becomes unemployed, applies for Jobseeker's Benefit but fails to qualify because he or she does not have enough social insurance contributions
ga: Sampla ná duine a bhíonn dífhostaithe agus a dhéanann iarratas ar Shochar Cuardaitheora Poist, ach go dteipeann orthu a bheith incháilithe toisc nach bhfuil dóthain ranníocaíochtaí aige nó aici

source: He or she can apply for Jobseeker's Allowance instead, which is the means-tested equivalent payment
ga: Is féidir leis nó léi iarratas a dhéanamh ar Liúntas Cuardaitheora Poist ina ionad - íocaíocht choibhéiseach atá tástáilte de réir acmhainne

source: A means test is where the Department of Social Protection examines all your sources of income to see whether they fall below a certain level
ga: Ciallaíonn Tástáil Acmhainne go liteartha go ndéanfaidh an Roinn Coimirce Sóisialaí scrúdú ar na foinsí ioncaim uile atá agat chun tástáil an dtiteann siad faoi leibhéal áirithe

source: How your means are tested varies from payment to payment
ga: Athraíonn an modh tástála a bhaineann le do chuid acmhainní ó íocaíocht go híocaíocht

source: In some instances, you are allowed a certain amount of income or savings before your entitlement to a payment is affected
ga: I gcásanna áirithe, ceadaítear méid áirithe airgid duit sula mbíonn tionchar ar bith aige ar do theidlíocht maidir le híocaíocht

source: The rules that determine how much you can or cannot have depend on the payment you apply for and are often referred to as income disregards
ga: Bíonn na rialacha a chinneann cé mhéid airgid gur féidir leat a choinneáil ag brath ar an íocaíocht ar a bhfuil iarratas á dhéanamh agat - is minic a thugtar "neamhaird ioncaim" ar an gcás seo

source: Universal payments are paid regardless of a person's income or social insurance record
ga: Déantar íocaíochtaí uilíocha gan aird ar ioncam nó ar thaifead árachais shóisialta an duine

source: They are dependent on the claimant satisfying specific personal circumstances
ga: Bíonn siad ag brath go huile ar an éilitheoir ag sásamh cúinsí pearsanta ar leith

source: An example is Child Benefit (often known as the Children's Allowance)
ga: Sampla ná Sochar Leanaí (Liúntas Leanaí an téarma coitianta)

source: A person must simply have a child dependant living with them as defined in the social welfare legislation
ga: Go simplí, caithfidh duine cleithiúnaí linbh a bheith ina gcónaí leo mar atá sainithe sa reachtaíocht leasa shóisialaigh

source: (Migrant workers from EEA Member States may get Child Benefit if their dependent child is resident in another EEA Member State.)
ga: (Féadfaidh oibrithe imirceacha ó Bhallstáit LEE Sochar Leanaí a fháil má bhíonn a gcleithiúnaí linbh cónaitheach i mBallstát LEE eile.)

source: The rules governing social welfare payments are set out in legislation and/or administrative guidelines
ga: Tá na rialacha a bhaineann le híocaíochtaí leasa shóisialaigh leagtha amach sa reachtaíocht agus/nó treoirlínte riaracháin

source: Most of the detailed Operational Guidelines governing social welfare payments are available from the Department of Social Protection
ga: Tá tromlach na dtreoirlínte mionsonraithe a rialaíonn íocaíochtaí ar fáil ar láithreán gréasáin na Roinne Coimirce Sóisialaí

source: For most social insurance and social assistance payments, decisions in relation to entitlement are made by Deciding Officers
ga: Don chuid is mó íocaíochtaí árachais shóisialaigh agus íocaíochtaí cúnaimh shóisialaigh, is iad na hOifigigh Bhreithiúnacha a dhéanann an cinneadh cé atá i dteideal íocaíochtaí

source: Deciding Officers are social welfare officials appointed under the social welfare legislation
ga: Is oifigigh leasa shóisialaigh iad na hOifigigh Bhreithiúnacha a ceapadh faoin reachtaíocht leasa shóisialaigh

source: Other payments such as those available under the Supplementary Welfare Allowance Scheme and certain administrative schemes are made by other officials within the Department of Social Protection
ga: Déanann Oifigigh Leasa Pobail agus oifigigh sa Roinn Coimirce Sóisialaí faoi seach íocaíochtaí eile, ar nós na Scéime Liúntas Forlíontach Leasa Forlíontach

source: Administrative schemes are payments that are not based in legislation but are based on government decisions and administrative guidelines
ga: Ciallaíonn scéimeanna riaracháin íocaíochtaí nach bhfuil bunaithe ar reachtaíocht, ach atá bunaithe ar chinntí an rialtais agus ar threoirlínte riaracháin

source: Examples include the awarding of credits and the Fuel Allowance
ga: Áirítear leo sin na samplaí seo a leanas: Liúntas um Fhilleadh ar Obair, bronnadh creidmheasanna, an Liúntas Breosla agus Bónas na Nollag

source: If you are not happy with a decision by the Department of Social Protection, you have a right to appeal decisions in relation to payments that are based in legislation
ga: Má tá tú míshásta le cinneadh a dhéanann an Roinn Coimirce Sóisialaí, tá se de cheart agat achomharc a lorg má tá an íocaíocht bunaithe ar reachtaíocht

source: Appeals are made to the Social Welfare Appeals Office, an independent statutory body
ga: Déantar achomhairc leis an Oifig Achomharc Leasa Shóisialaigh, eagraíocht neamhspleách reachtúil

source: Find out how to appeal a decision of the Department of Social Protection
ga: Faigh amach anseo conas achomharc a lorg ón Roinn Coimirce Sóisialaí

source: If you are not happy with a decision in relation to an administrative scheme, you can ask for an internal review
ga: Má tá tú míshásta le cinneadh maidir le scéim riaracháin, is féidir leat athbhreithniú inmheánach a lorg

source: In this instance, you would put your case to a more senior official within the Department requesting an internal review to re-examine your application
ga: Sa chás seo cuireann tú do chás os comhair oifigigh níos sinsearaí laistigh den Roinn agus iarrann tú athbhreithniú inmheánach le d'iarratas a mheas arís

source: You should try to submit as much additional information as possible to help your case
ga: Ba chóir duit an oiread eolais bhreise agus is féidir leat a chabhródh le do chás a chur faoi bhráid an oifigigh

source: Penalties for false or misleading statements made to obtain a social welfare payment for you or for any other person, may result in large fines or prison for up to three years
ga: D'fhéadfadh fíneálacha móra nó príosúnacht suas go dtí 3 bhliain a leanúint as pionóis mar gheall ar ráiteas míthreoracha nó bréagacha um íocaíocht leasa shóisialaigh a fháil

source: The Department of Social Protection has a Compliance and Fraud Strategy that aims to reduce social welfare fraud
ga: D’fhoilsigh an Roinn Coimirce Sóisialaí Tionscnamh Calaoise chun dul i ngleic le calaois leasa shóisialaigh

source: You can report possible cases of fraud to the Department
ga: Is féidir leat tuairisc faoi chásanna calaoise d'fhéadfadh a bheith ann a thabhairt don Roinn

source: Rates of payment and dependants
ga: Rátaí íocaíochta agus cleithiúnaithe

source: Social welfare payments are divided into payments for the claimant, known as the personal rate of payment and payments for any adult and child dependants
ga: Roinntear íocaíochtaí leasa shóisialaigh in íocaíochtaí don éilitheoir, ar a dtugtar an "ráta pearsanta" íocaíochta agus íocaíochtaí do dhuine fásta agus cleithiúnaithe linbh ar bith

source: The SW 19 Rates of Payment Booklet, published by the Department of Social Protection every year, details the amount of money payable for each scheme and the amount that will be awarded to dependants of the claimant
ga: Tugtar sonraí san LS 19 Leabhrán na Rátaí Íocaíochta, a fhoilsíonn an Roinn Coimirce Sóisialaí gach bliain, faoin méid airgid atá iníoctha maidir le gach scéim agus an méid a bhronnfar ar chleithiúnaithe an éilitheora

source: An adult dependant of a claimant is called a qualified adult
ga: Tugtar duine fásta cáilithe ar chleithiúnaí aosaigh an éilitheora

source: A payment for a qualified adult may be paid for a person who is wholly or mainly maintained by the claimant and is either:
ga: Is féidir íocaíocht le haghaidh duine fásta cáilithe a íoc do dhuine atá cothaithe go hiomlán nó go príomha ag éilitheoir mar seo a leanas:

source: • A spouse, civil partner or cohabitant
ga: • Céile, páirtnéir sibhialta nó comhchónaitheoir

source: • A person over 16 years of age who is caring for a child dependant of the claimant
ga: • Duine os cionn 16 bliana d’aois a thugann cúram do chleithiúnaí linbh an éilitheora

source: More information is available in our document about claiming for an adult dependant
ga: Tuilleadh eolais ar fáil inár ndoiciméad faoi éileamh a dhéanamh le haghaidh cleithiúnaí linbh

source: A child dependant is referred to as a qualified child
ga: Tagraítear don chleithiúnaí linbh mar leanbh cáilithe

source: • Ordinarily resident in the State
ga: • A bheith ina ghnáthchónaí sa Stát

source: • Not detained in a reformatory or industrial school
ga: • Gan a bheith faoi choinneáil i scoil cheartúcháin nó scoil saothair

source: • Satisfy the age conditions
ga: • An coinníoll aoise a shásamh

source: Children under 18 are regarded as qualified children
ga: Breathnaítear ar leanaí faoi bhun 18 mbliana d’aois mar leanaí cáilithe

source: Payments for child dependants are made for children over 18 in some circumstances
ga: Déantar íocaíochtaí le cleithiúnaithe linbh i gcás leanaí os cionn 18 mbliana d’aois faoi chúinsí áirithe

source: More information is available in our document about claiming for a child dependant
ga: Tuilleadh eolais ar fáil inár ndoiciméad faoi éileamh a dhéanamh le haghaidh cleithiúnaí linbh

source: If you wish to apply for a particular social welfare payment, you should contact your social welfare local office or Intreo centre for an application form and an information leaflet. You can also access forms online
ga: Más mian leat iarratas a dhéanamh ar íocaíocht leasa shóisialaigh áirithe, ba chóir duit teagmháil a dhéanamh le d’oifig leasa shóisialaigh ó Ionad Intreo áitiúil chun foirm iarratais agus bileog faisnéise a fháil

source: The online information The address and phone number of your social welfare local office or Intreo centre is also available in the telephone directory
ga: Tá seoladh agus uimhir theileafóin d’oifig leasa shóisialaigh ó Ionad Intreo áitiúil ar fáil san eolaire teileafóin freisin

source: If you are not satisfied with a decision by the Department in relation to a payment you can contact the Social Welfare Appeals Office for an appeals form and details of how to appeal
ga: Mura bhfuil tú sásta le cinneadh na Roinne i ndáil leis an íocaíocht, is féidir leat teagmháil a dhéanamh leis an Oifig Achomhairc Leasa Shóisialaigh chun foirm achomhairc a fháil agus sonraí maidir le conas achomharc a dhéanamh

source: Yopu can get independent advice on how to appeal a decision from your local Citizens Information Centre
ga: Más féidir, déan iarracht comhairle neamhspleách a fháil ó d’Ionad Faisnéise do Shaoránaigh áitiúil faoi conas achomharc a dhéanamh ar chinneadh
